{
		"Book": {
			"Title": "Legal",
			"FirstPage": "legal-terms-of-service-",
			"ChaptersNo": "1",
			"PagesNo": "2",
			"Id" : "",
			"Tags": { "MTR":"26 min" },
			"TOC" : [
            {
                "Chapter": "Legal",
				"Id": "legal-terms-of-service-",
                "Pages": [
	                    {
                        "Page": "Terms of Service ",
                        "Id": "legal-terms-of-service-",
                        "Subjects": [
							{
								"Subject":"Welcome to Octopus!",
								"Id":"welcome-to-octopus-"
							},
							{
								"Subject":"Use of our Services",
								"Id":"use-of-our-services"
							},
							{
								"Subject":"Your Octopus Account",
								"Id":"your-octopus-account"
							},
							{
								"Subject":"Privacy and copyright protection",
								"Id":"privacy-and-copyright-protection"
							},
							{
								"Subject":"Your content in our Services",
								"Id":"your-content-in-our-services"
							},
							{
								"Subject":"Software in our Services",
								"Id":"software-in-our-services"
							},
							{
								"Subject":"Modification and termination of our Services",
								"Id":"modification-and-termination-of-our-services"
							},
							{
								"Subject":"Our Warranties and Disclaimers",
								"Id":"our-warranties-and-disclaimers"
							},
							{
								"Subject":"Limits on Liability",
								"Id":"limits-on-liability"
							},
							{
								"Subject":"Business Uses of Our Services",
								"Id":"business-uses-of-our-services"
							},
							{
								"Subject":"About These Terms",
								"Id":"about-these-terms"
							}
						]
					},

	                    {
                        "Page": "Privacy Policy",
                        "Id": "legal-privacy-policy",
                        "Subjects": [
							{
								"Subject":"Definitions",
								"Id":"definitions"
							},
							{
								"Subject":"Information Collection and Use",
								"Id":"information-collection-and-use"
							},
							{
								"Subject":"Personal Data",
								"Id":"personal-data"
							},
							{
								"Subject":"Usage Data",
								"Id":"usage-data"
							},
							{
								"Subject":"Tracking & Cookies Data",
								"Id":"tracking-cookies-data"
							},
							{
								"Subject":"Use of Data",
								"Id":"use-of-data"
							},
							{
								"Subject":"Legal Basis for Processing Personal Data under the General Data Protection Regulation (GDPR)",
								"Id":"legal-basis-for-processing-personal-data-under-the-general-data-protection-regulation-gdpr-"
							},
							{
								"Subject":"Retention of Data",
								"Id":"retention-of-data"
							},
							{
								"Subject":"Transfer of Data",
								"Id":"transfer-of-data"
							},
							{
								"Subject":"Disclosure of Data",
								"Id":"disclosure-of-data"
							},
							{
								"Subject":"Security of Data",
								"Id":"security-of-data"
							},
							{
								"Subject":"Our Policy on Do Not Track Signals under the California Online Protection Act (CalOPPA)",
								"Id":"our-policy-on-do-not-track-signals-under-the-california-online-protection-act-caloppa-"
							},
							{
								"Subject":"Your Data Protection Rights under the General Data Protection Regulation (GDPR)",
								"Id":"your-data-protection-rights-under-the-general-data-protection-regulation-gdpr-"
							},
							{
								"Subject":"Service Providers",
								"Id":"service-providers"
							},
							{
								"Subject":"Links to Other Sites",
								"Id":"links-to-other-sites"
							},
							{
								"Subject":"Children's Privacy",
								"Id":"children-s-privacy"
							},
							{
								"Subject":"Cookies",
								"Id":"cookies"
							},
							{
								"Subject":"Changes to This Privacy Policy",
								"Id":"changes-to-this-privacy-policy"
							},
							{
								"Subject":"Contact Us",
								"Id":"contact-us"
							}
						]
					}
                ]
            }
        ],

		"Content":{
	            "legal-terms-of-service-": {
					"ChapterNo": 0,
					"PageNo": 0,
					"SubjectsNo": "11",
					"PrevPage": "",
					"PrevPageId": "",
					"NextPage": "Privacy Policy",
					"NextPageId": "legal-privacy-policy",
			"Page": [
						{
							"Kind": "HTML",
							"HTML": "<h1 hidden>Legal</h1><h2 id=\"legal-terms-of-service-\">Terms of Service </h2><p></p><h3 id=\"welcome-to-octopus-\">Welcome to Octopus!</h3><p>Thank you for using our products and services (“Services”). The Services are provided by Human Dialog S.A. (“Human Dialog”). By using our Octopus Services, you accept these terms and conditions. Please read them carefully. IF YOU DO NOT AGREE WITH THESE TERMS AND CONDITIONS, PLEASE DO NOT USE OUR SERVICES.</p><h3 id=\"use-of-our-services\">Use of our Services</h3><p>You must comply with all rules made available through the Services. You must not abuse our Services, such as tampering with them or attempting to access them in any way other than through the interface, provided API and instructions we provide. You may only use our Services in accordance with the law, including applicable export and re-export control laws. We may suspend or terminate our Services if you do not comply with our terms or policies, or if we are investigating suspected misconduct.</p><p>Your use of our Services does not give you any intellectual property rights in them or in the content you access. You may not use the content of our Services unless you have obtained permission to do so from the owner of the content or it is permitted by law. These Terms and Conditions do not grant you the right to use any trademarks or logos used in our Services. Do not remove, obscure or alter any legal notices displayed on or with our Services.</p><p>In connection with your use of the Services, we may send you service announcements, administrative messages and other information. You may opt out of some of these communications.</p><p>Most of our Services are available on mobile devices. Do not use such Services in a way that distracts you or prevents you from complying with traffic laws or safety rules.</p><h3 id=\"your-octopus-account\">Your Octopus Account</h3><p>You may need an ObjectReef account to use the Octopus Services. To protect your account, you must keep your password confidential. You are responsible for actions taken on or through your account. Try not to use your account password in third-party applications.</p><h3 id=\"privacy-and-copyright-protection\">Privacy and copyright protection</h3><p>The Octopus Privacy Policy explains how we treat your personal information and protect your privacy when you use our Services. By using our Services, you agree that Octopus may use such data in accordance with our privacy policies.</p><h3 id=\"your-content-in-our-services\">Your content in our Services</h3><p>Some of our Services allow you to create, upload, save, send or receive content. You retain the intellectual property rights that you own with respect to that content. In short, what belongs to you remains yours.</p><p>You can find more information about how Octopus uses and stores content in the Privacy Policy or additional terms and conditions for specific Services. If you send feedback or suggestions about our Services, we may use them without obligation to you.</p><h3 id=\"software-in-our-services\">Software in our Services</h3><p>When a Service requires or includes downloadable software, that software may automatically update on your device when a new version or feature becomes available. Some Services may allow you to customize automatic update settings.</p><p>Human Dialog grants you a personal, worldwide, royalty-free, non-transferable and non-exclusive license to use the software provided as part of the Octopus Services. This license is intended to enable you to use the Octopus Services in accordance with these terms. You may not copy, modify, distribute, sell or rent any part of our Services. </p><p>The Octopus source code is made available under the MIT open source license. Under this license, you may freely copy, modify and distribute the source code, in whole or in parts. </p><h3 id=\"modification-and-termination-of-our-services\">Modification and termination of our Services</h3><p>We may modify these terms or any additional terms that apply to a Service to, for example, reflect changes to the law or changes to our Services. You should look at the terms regularly. We'll post notice of modifications to these terms on this page. Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted. However, changes addressing new functions for a Service or changes made for legal reasons will be effective immediately. If you do not agree to the modified terms for a Service, you should discontinue your use of the Service.</p><p>If there is a conflict between these terms and the additional terms, the additional terms will control for that conflict.</p><h3 id=\"our-warranties-and-disclaimers\">Our Warranties and Disclaimers</h3><p>We provide our Services using a commercially reasonable level of skill and care and we hope that you will enjoy using them. But there are certain things that we don't promise about our Services. </p><p>OTHER THAN AS EXPRESSLY SET OUT IN THESE TERMS OR ADDITIONAL TERMS, NEITHER HUMAN DIALOG NOR ITS SUPPLIERS OR DISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE SERVICES.</p><p></p><p>SOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE EXTENT PERMITTED BY LAW, WE EXCLUDE ALL WARRANTIES.</p><h3 id=\"limits-on-liability\">Limits on Liability</h3><p>We work hard to provide the best Products we can and to specify clear guidelines for everyone who uses them. However, THE SERVICE IS PROVIDED \"AS IS\".</p><p>\nWE ARE UNABLE TO PREDICT WHEN PROBLEMS MAY OCCUR WITH OUR SERVICES. ACCORDINGLY, OUR LIABILITY IS LIMITED TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, AND IN NO EVENT WILL WE BE LIABLE TO YOU FOR ANY LOST PROFITS, REVENUES, INFORMATION OR DATA, OR FOR CONSEQUENTIAL, SPECIAL, INDIRECT, EXEMPLARY, PUNITIVE OR INCIDENTAL DAMAGES ARISING OUT OF OR IN CONNECTION WITH THESE TERMS AND CONDITIONS OR HUMAN DIALOG PRODUCTS, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. YOU USE AND/OR PURCHASE THE SERVICE AT YOUR OWN RISK.</p><h3 id=\"business-uses-of-our-services\">Business Uses of Our Services</h3><p>If you use our Services on behalf of a company, that company accepts these terms and conditions. It will indemnify and hold Human Dialog and its affiliates, officers, agents and employees harmless from any claim, suit or action arising out of or related to your use of the Services or violation of these terms and conditions, including any liability or expense arising out of claims, losses, damages, suits, judgments, litigation costs and attorneys' fees.</p><h3 id=\"about-these-terms\">About These Terms</h3><p>These terms and conditions govern the relationship between Human Dialog and the user with respect to the use of Octopus services. They do not create any third-party beneficiary rights. If you do not comply with these terms and conditions and we do not act immediately, this does not mean that we give up any rights we may have (such as taking action in the future). If it turns out that a condition is not enforceable, no other conditions will be affected.</p><p>For more information, please <a href=\"/tcontact\">contact</a> us.</p><p></p><p></p>"
						}
					]
				},
	            "legal-privacy-policy": {
					"ChapterNo": 0,
					"PageNo": 1,
					"SubjectsNo": "19",
					"PrevPage": "Terms of Service ",
					"PrevPageId": "legal-terms-of-service-",
					"NextPage": "",
					"NextPageId": "",
			"Page": [
						{
							"Kind": "HTML",
							"HTML": "<h2 id=\"legal-privacy-policy\">Privacy Policy</h2><p>Effective date: August 24, 2023</p><p>This page informs you of our policies regarding the collection, use and disclosure of personal data when you use our Service and the choices you have associated with that data.</p><p>We use your data to provide and improve the Service. By using the Service, you agree to the collection and use of information in accordance with this policy. Unless otherwise defined in this Privacy Policy, the terms used in this Privacy Policy have the same meanings as in our Terms and Conditions.</p><h3 id=\"definitions\">Definitions</h3><p>Human Dialog</p><p>\"Human Dialog\" refers to Human Dialog S.A. company located at Kazimierza Wielkiego 27, 55-070 Wrocław, Poland. When “We” or “Us” or “Our” are used in this policy, it is a reference to Human Dialog.</p><p>Service</p><p>Service means the https://objectreef.dev website operated by Human Dialog.</p><p>Application</p><p>An application refers to a software development tool running on any electronic device as an executable file with dependencies and extensions. The program is distributed by Human Dialog as an installer, container image or portable package. The application can be downloaded via the Service.</p><p>Personal Data</p><p>Personal Data means data about a living individual who can be identified from those data (or from those and other information either in our possession or likely to come into our possession).</p><p>Usage Data</p><p>Usage Data is data collected automatically either generated by the use of the Service, from the Service infrastructure itself (for example, the duration of a page visit) or running Application..</p><p>Cookies</p><p>Cookies are small files stored on your device (computer or mobile device).</p><p>Data Controller</p><p>Data Controller means the natural or legal person who (either alone or jointly or in common with other persons) determines the purposes for which and the manner in which any personal information are, or are to be, processed.</p><p>For the purpose of this Privacy Policy, we are a Data Controller of your Personal Data.</p><p>Data Processors (or Service Providers)</p><p>Data Processor (or Service Provider) means any natural or legal person who processes the data on behalf of the Data Controller.</p><p>We may use the services of various Service Providers in order to process your data more effectively.</p><p>Data Subject (or User)</p><p>Data Subject is any living individual who is using our Service and is the subject of Personal Data.</p><h3 id=\"information-collection-and-use\">Information Collection and Use</h3><p>We collect several different types of information for various purposes to provide and improve our Service to you.</p><p>Types of Data Collected</p><h3 id=\"personal-data\">Personal Data</h3><p>While using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you (\"Personal Data\"). Personally identifiable information may include, but is not limited to:</p><p>Email address</p><p>First name and last name</p><p>Cookies and Usage Data</p><p>We may use your Personal Data to contact you with newsletters, marketing or promotional materials and other information that may be of interest to you. You may opt out of receiving any, or all, of these communications from us by following the unsubscribe link or instructions provided in any email we send or by contacting us.</p><h3 id=\"usage-data\">Usage Data</h3><p>We may also collect information that your browser sends whenever you visit our Service or when you access the Service by or through a mobile device (\"Usage Data\").</p><p>This Usage Data may include information such as your computer's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that you visit, the time and date of your visit, the time spent on those pages, unique device identifiers and other diagnostic data.</p><p>When you access the Service with a mobile device, this Usage Data may include information such as the type of mobile device you use, your mobile device unique ID, the IP address of your mobile device, your mobile operating system, the type of mobile Internet browser you use, unique device identifiers and other diagnostic data.</p><p>We may also collect usage data through the Application, as data sent from time to time in the background of process operation. Telemetry data is collected to help understand how to improve the product.  For example, this data helps in debugging problems, such as slow application startup, and in prioritizing new features. </p><p>The application collects three basic types of telemetry data: </p><p>Crash reports - collect diagnostic information when ObjectReef crashes and send it to Human Dialog to help understand why the crash occurred and what changes are needed to prevent future failures</p><p>Error telemetry - collects information about errors that do not cause the application to crash but are unexpected.</p><p>Development usage data - collects information about how features are used and work in ObjectReef, which helps us prioritize future product improvements.</p><h3 id=\"tracking-cookies-data\">Tracking & Cookies Data</h3><p>We use cookies and similar tracking technologies to track the activity on our Service and we hold certain information.</p><p>Cookies are files with a small amount of data which may include an anonymous unique identifier. Cookies are sent to your browser from a website and stored on your device. Other tracking technologies are also used such as beacons, tags and scripts to collect and track information and to improve and analyse our Service.</p><p>You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent. However, if you do not accept cookies, you may not be able to use some portions of our Service.</p><p>Examples of Cookies we use:</p><p>Session Cookies. We use Session Cookies to operate our Service.</p><p>Preference Cookies. We use Preference Cookies to remember your preferences and various settings.</p><p>Security Cookies. We use Security Cookies for security purposes.</p><p>Advertising Cookies. Advertising Cookies are used to serve you with advertisements that may be relevant to you and your interests.</p><h3 id=\"use-of-data\">Use of Data</h3><p>Human Dialog uses the collected data for various purposes:</p><p>To provide and maintain our Service</p><p>To notify you about changes to our Service</p><p>To allow you to participate in interactive features of our Service when you choose to do so</p><p>To provide customer support</p><p>To gather analysis or valuable information so that we can improve our Service</p><p>To monitor the usage of our Service</p><p>To detect, prevent and address technical issues</p><p>To provide you with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless you have opted not to receive such information</p><h3 id=\"legal-basis-for-processing-personal-data-under-the-general-data-protection-regulation-gdpr-\">Legal Basis for Processing Personal Data under the General Data Protection Regulation (GDPR)</h3><p>If you are from the European Economic Area (EEA), Human Dialog legal basis for collecting and using the personal information described in this Privacy Policy depends on the Personal Data we collect and the specific context in which we collect it.</p><p>Human Dialog may process your Personal Data because:</p><p>We need to perform a contract with you</p><p>You have given us permission to do so</p><p>The processing is in our legitimate interests and it is not overridden by your rights</p><p>For payment processing purposes</p><p>To comply with the law</p><h3 id=\"retention-of-data\">Retention of Data</h3><p>Human Dialog will retain your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes and enforce our legal agreements and policies.</p><p>Human Dialog will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of our Service, or we are legally obligated to retain this data for longer periods.</p><h3 id=\"transfer-of-data\">Transfer of Data</h3><p>Your information, including Personal Data, may be transferred to — and maintained on — computers located outside of your state, province, country or other governmental jurisdiction where the data protection laws may differ from those of your jurisdiction.</p><p>If you are located outside European Economic Area (EEA) and choose to provide information to us, please note that we transfer the data, including Personal Data, to European Economic Area (EEA) and process it there.</p><p>Your consent to this Privacy Policy followed by your submission of such information represents your agreement to that transfer.</p><p>Human Dialog will take all the steps reasonably necessary to ensure that your data is treated securely and in accordance with this Privacy Policy and no transfer of your Personal Data will take place to an organisation or a country unless there are adequate controls in place including the security of your data and other personal information.</p><h3 id=\"disclosure-of-data\">Disclosure of Data</h3><h4>Business Transaction</h4><p>If Human Dialog is involved in a merger, acquisition or asset sale, your Personal Data may be transferred. We will provide notice before your Personal Data is transferred and becomes subject to a different Privacy Policy.</p><h4>Disclosure for Law Enforcement</h4><p>Under certain circumstances, Human Dialog may be required to disclose your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).</p><h4>Legal Requirements</h4><p>Human Dialog may disclose your Personal Data in the good faith belief that such action is necessary to:</p><p>To comply with a legal obligation</p><p>To protect and defend the rights or property of Human Dialog</p><p>To prevent or investigate possible wrongdoing in connection with the Service</p><p>To protect the personal safety of users of the Service or the public</p><p>To protect against legal liability</p><h3 id=\"security-of-data\">Security of Data</h3><p>The security of your data is important to us but remember that no method of transmission over the Internet or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Data, we cannot guarantee its absolute security.</p><h3 id=\"our-policy-on-do-not-track-signals-under-the-california-online-protection-act-caloppa-\">Our Policy on Do Not Track Signals under the California Online Protection Act (CalOPPA)</h3><p>We do not support Do Not Track (\"DNT\"). Do Not Track is a preference you can set in your web browser to inform websites that you do not want to be tracked.</p><p>You can enable or disable Do Not Track by visiting the Preferences or Settings page of your web browser.</p><h3 id=\"your-data-protection-rights-under-the-general-data-protection-regulation-gdpr-\">Your Data Protection Rights under the General Data Protection Regulation (GDPR)</h3><p>If you are a resident of the European Economic Area (EEA), you have certain data protection rights. Human Dialog aims to take reasonable steps to allow you to correct, amend, delete or limit the use of your Personal Data.</p><p>If you wish to be informed about what Personal Data we hold about you and if you want it to be removed from our systems, please contact us.</p><p>In certain circumstances, you have the following data protection rights:</p><p>The right to access, update or delete the information we have on you. Whenever made possible, you can access, update or request deletion of your Personal Data directly within your account settings section. If you are unable to perform these actions yourself, please contact us to assist you.</p><p>The right of rectification. You have the right to have your information rectified if that information is inaccurate or incomplete.</p><p>The right to object. You have the right to object to our processing of your Personal Data.</p><p>The right of restriction. You have the right to request that we restrict the processing of your personal information.</p><p>The right to data portability. You have the right to be provided with a copy of the information we have on you in a structured, machine-readable and commonly used format.</p><p>The right to withdraw consent. You also have the right to withdraw your consent at any time where Appwrite relied on your consent to process your personal information.</p><p>Please note that we may ask you to verify your identity before responding to such requests.</p><p>You have the right to complain to a Data Protection Authority about our collection and use of your Personal Data. For more information, please contact your local data protection authority in the European Economic Area (EEA).</p><h3 id=\"service-providers\">Service Providers</h3><p>We may employ third party companies and individuals to facilitate our Service (\"Service Providers\"), provide the Service on our behalf, perform Service-related services or assist us in analysing how our Service is used.</p><p>These third parties have access to your Personal Data only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.</p><h4>Analytics</h4><p>We may use third-party Service Providers to monitor and analyse the use of our Service.</p><p>Google Analytics</p><p>Google Analytics is a web analytics service offered by Google that tracks and reports website traffic. Google uses the data collected to track and monitor the use of our Service. This data is shared with other Google services. Google may use the collected data to contextualise and personalise the ads of its own advertising network.</p><p>For more information on the privacy practices of Google, please visit the Google Privacy & Terms web page: https://policies.google.com/privacy?hl=en</p><h4>Behavioral Remarketing</h4><p>Human Dialog uses remarketing services to advertise on third party websites to you after you visited our Service. We and our third-party vendors use cookies to inform, optimise and serve ads based on your past visits to our Service.</p><p>Google AdWords</p><p>Google AdWords remarketing service is provided by Google Inc.</p><p>You can opt-out of Google Analytics for Display Advertising and customise the Google Display Network ads by visiting the Google Ads Settings page: http://www.google.com/settings/ads</p><p>Google also recommends installing the Google Analytics Opt-out Browser Add-on - https://tools.google.com/dlpage/gaoptout - for your web browser. Google Analytics Opt-out Browser Add-on provides visitors with the ability to prevent their data from being collected and used by Google Analytics.</p><p>For more information on the privacy practices of Google, please visit the Google Privacy & Terms web page: https://policies.google.com/privacy?hl=en</p><p>Twitter</p><p>Twitter remarketing service is provided by Twitter Inc.</p><p>You can opt-out from Twitter's interest-based ads by following their instructions: https://support.twitter.com/articles/20170405</p><p>You can learn more about the privacy practices and policies of Twitter by visiting their Privacy Policy page: https://twitter.com/privacy</p><p>Facebook</p><p>Facebook remarketing service is provided by Facebook Inc.</p><p>You can learn more about interest-based advertising from Facebook by visiting this page: https://www.facebook.com/help/516147308587266</p><p>To opt-out from Facebook's interest-based ads, follow these instructions from Facebook: https://www.facebook.com/help/568137493302217</p><p>Facebook adheres to the Self-Regulatory Principles for Online Behavioural Advertising established by the Digital Advertising Alliance. You can also opt-out from Facebook and other participating companies through the Digital Advertising Alliance in the USA http://www.aboutads.info/choices/, the Digital Advertising Alliance of Canada in Canada http://youradchoices.ca/ or the European Interactive Digital Advertising Alliance in Europe http://www.youronlinechoices.eu/, or opt-out using your mobile device settings.</p><p>For more information on the privacy practices of Facebook, please visit Facebook's Data Policy: https://www.facebook.com/privacy/explanation</p><p>LinkedIn</p><p>LinkedIn remarketing service is provided by LinkedIn Inc.</p><p>You can learn more about interest-based advertising from LinkedIn by visiting this page: https://www.linkedin.com/legal/ads-policy</p><p>To opt-out from LinkedIn's interest-based ads, follow these instructions from LinkedIn: https://www.linkedin.com/help/linkedin/answer/62931/manage-advertising-preferences</p><p>For more information on the privacy practices of LinkedIn, please visit LinkedIn's Privacy Policy: https://www.linkedin.com/legal/privacy-policy</p><h4>Payments</h4><p>We may provide paid products and/or services within the Service. In that case, we use third-party services for payment processing (e.g. payment processors).</p><p>We will not store or collect your payment card details. That information is provided directly to our third-party payment processors whose use of your personal information is governed by their Privacy Policy. These payment processors adhere to the standards set by PCI-DSS as managed by the PCI Security Standards Council, which is a joint effort of brands like Visa, MasterCard, American Express and Discover. PCI-DSS requirements help ensure the secure handling of payment information.</p><p>The payment processors we work with are:</p><p>Stripe</p><p>Their Privacy Policy can be viewed at https://stripe.com/us/privacy</p><p>Przelewy24</p><p>Their Privacy Policy can be viewed at https://www.przelewy24.pl/en/information-obligation-gdpr-payer</p><h3 id=\"links-to-other-sites\">Links to Other Sites</h3><p>Our Service may contain links to other sites that are not operated by us. If you click a third party link, you will be directed to that third party's site. We strongly advise you to review the Privacy Policy of every site you visit.</p><p>We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.</p><h3 id=\"children-s-privacy\">Children's Privacy</h3><p>Our Service does not address anyone under the age of 18 (\"Children\").</p><p>We do not knowingly collect personally identifiable information from anyone under the age of 18. If you are a parent or guardian and you are aware that your Child has provided us with Personal Data, please contact us. If we become aware that we have collected Personal Data from children without verification of parental consent, we take steps to remove that information from our servers.</p><h3 id=\"cookies\">Cookies</h3><p>The Service uses cookies and similar files or technologies to automatically collect and store information about your computer, device, and Service usage, in order to improve their performance and enhance your user experience. We use the general term \"<b>cookies</b>\" in this policy to refer to these technologies and all such similar technologies that collect information automatically when you are using our Service where this policy is posted. </p><p>If you do not accept the use of these cookies, please disable them using 'Cookies' button in footer of the Service, or by changing your browser settings so that cookies from this Service cannot be placed on your computer or mobile device. Important: disabling cookies may impair certain Service features.</p><p>There are two broad categories of cookies:</p><p><b>First party cookies,</b> served directly by us to your computer or mobile device.</p><p><b>Third party cookies,</b> which are served by a third party on our behalf. We use third-party cookies for functionality, performance/analytics, marketing, unclassified and other technologies, and social media purposes. The third-party cookies are outside of our control. The third parties may, at any time, change their terms of service, purpose and use of cookies, etc.</p><p>Cookies can remain on your computer or mobile device for different periods of time. Some cookies are 'session cookies', meaning that they exist only while your browser is open. These are deleted automatically once you close your browser. Other cookies are 'permanent cookies', meaning that they survive after your browser is closed. They can be used by websites to recognize your computer when you open your browser and browse the Internet again.</p><h4>Web beacons</h4><p>Cookies are not the only way to recognize or track visitors to a website. We may use other, similar technologies from time to time, like web beacons (sometimes called \"tracking pixels\" or \"clear gifs\"). These are small graphics files that contain a unique identifier that enable us to recognize when someone has visited our website. This allows us, for example, to monitor the traffic patterns of users from one page within our website to another, to deliver or communicate with cookies, to understand whether you have come to our website from an online advertisement displayed on a third-party website, to improve website performance and to measure the success of email marketing campaigns. In most instances, these technologies are reliant on cookies to function, and therefore declining cookies prevents them from functioning.</p><p>You may have the right to decide whether to accept or reject cookies. When you access our Service, you are presented with a cookie consent mechanism that allows you to accept or reject cookies that are not essential cookies. Your consent is valid for 12 moths, but you can change your cookies preferences any time by clicking 'Cookie' button in the footer of the Service. You may also control cookies by setting your browser to turn off cookies. If you turn off cookies in your browser settings, web beacon and other technologies will still detect your visits to the Service; however, they will not be associated with information otherwise stored in cookies.</p><h4>Targeted advertising</h4><p>Third parties may drop cookies on your computer or mobile device to serve advertising through our website. These companies may use information about your visits to this and other websites in order to provide relevant advertisements about goods and services that you may be interested in. They may also employ technology that is used to measure the effectiveness of advertisements. The information collected through this process does not enable us or them to identify your name, contact details or other personally identifying details unless you choose to provide these to us.</p><h4>How do we use cookies?</h4><p>We use cookies to:</p><p>track traffic flow and patterns of travel in connection with the Service;</p><p>understand the total number of visitors to the Service on an ongoing basis and the types of internet browsers (e.g. Chrome, Firefox, Safari, or Internet Explorer) and operating systems (e.g. Windows or Mac) used by our visitors;</p><p>monitor the performance of the Service and to continually improve it; and</p><p>customize and enhance your online experience.</p><h4>What types of cookies do we use?</h4><p>The types of cookies used by us in connection with the Service can be considered 'essential website cookies', 'preferences cookies' and 'marketing cookies'.</p><p>-<b>Essential cookies</b>\nThese cookies are essential to provide you with services available through this Site and to use some of its features, such as access to secure areas. Without these cookies we will not be able to provide services that you require, such as transactional pages and secure login accounts.</p><p><b>-Preferences cookies</b><b>\n</b>These cookies record information about choices you've made and allow us to tailor the website to you. These cookies allow us to provide you with our services in the way in which you have required, as you continue to use or come back to our Site. For example, these cookies allow us to:</p><p>Save your location preference if you have set your location on the homepage in order to receive a localized information;</p><p>Remember settings you have applied, such as layout, text size, preferences, and colors;</p><p>Show you when you are logged in; and</p><p>Store accessibility options.</p><p>-<b>Analytics Cookies</b><b>\n</b>We use performance/analytics cookies to analyze how the website is accessed, used, or is performing. We do this in order to provide you with a better user experience and to maintain, operate and continually improve the website. For example, these cookies allow us to:</p><p>Better understand our website visitors so that we can improve how we present our content;</p><p>Test different design ideas for particular pages, such as our homepage;</p><p>Collect information about Site visitors such as where they are located and what browsers they are using;</p><p>Determine the number of unique users of the website;</p><p>Improve the website by measuring any errors that occur; and</p><p>Conduct research and diagnostics to improve product offerings.</p><p><b>- Marketing</b><b>\n</b>We use marketing cookies to deliver many types of targeted digital marketing. We do this in order to provide you with a better user experience and to maintain, operate and continually improve the website. The cookie store user data and behavior information, which allows advertising services to target audience according to variables. For example, these cookies allow us to:</p><p>Observe the site performance and generate retargeting (Site retargeting, search retargeting, etc).</p><p>Maintain and improve the website and our products</p><h4>Third Party Websites' Cookies</h4><p>When using our website, you may be directed to other websites for such activities as surveys, to make payment, or for job applications. These websites may use their own cookies. We do not have control over the placement of cookies by other websites you visit, even if you are directed to them from our website.</p><p>If you use the buttons that allow you to share products and content with your friends via social networks like Google, YouTube,Twitter and Facebook, these companies may set a cookie on your computer memory. Find out more about these here:</p><p>https://www.facebook.com/about/privacy</p><p>http://twitter.com/privacy</p><p>https://www.linkedin.com/legal/privacy-policy</p><p>http://www.google.com/intl/en-GB/policies/privacy</p><p>https://docs.github.com/en/site-policy/privacy-policies/github-privacy-statement</p><h3 id=\"changes-to-this-privacy-policy\">Changes to This Privacy Policy</h3><p>We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.</p><p>We will let you know via email and/or a prominent notice on our Service, prior to the change becoming effective and update the \"effective date\" at the top of this Privacy Policy.</p><p>You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.</p><h3 id=\"contact-us\">Contact Us</h3><p>If you have any questions about this Privacy Policy, please contact us by e-mail at legal@humandialog.com.pl </p><p></p><p></p><p></p>"
					}
				]
			}
		}
	}
}